In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
import sqlite3

In [4]:
con = sqlite3.connect("D:/Programming/My_DB/kospi.db")

In [5]:
df = pd.read_sql("SELECT * From kakao", con, index_col=None)

In [6]:
df

       Date   Open   High    Low  Closing  Volumn
0  16.06.03  97000  98600  96900    98000  321405
1  16.06.02  99000  99300  96300    97500  556790

In [7]:
df1 = pd.read_sql("SELECT * From test", con, index_col=None)

In [8]:
df1

   index  col0  col1  col2
0      0     1    10   100
1      1     2    20   200
2      2     3    30   300
3      3     4    40   400

In [9]:
pd.read_sql("SELECT * From kakao", con, index_col="Open")

           Date   High    Low  Closing  Volumn
Open
97000  16.06.03  98600  96900    98000  321405
99000  16.06.02  99300  96300    97500  556790

In [10]:
pd.read_sql("SELECT * From test", con, index_col="index")

       col0  col1  col2
index
0         1    10   100
1         2    20   200
2         3    30   300
3         4    40   400